Revit 2027 API
ElectricalLoadClassification.PanelEstimatedLabel Property
 The name template for the estimated demand parameter on the load classification.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string PanelEstimatedLabel { get; set; }
Public Property PanelEstimatedLabel As String
	Get
	Set
public:
property String^ PanelEstimatedLabel {
	String^ get ();
	void set (String^ value);
}
member PanelEstimatedLabel : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: panelEstimatedLabel is not a valid globalization format string.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace